<?php
    require_once('includes/config.php');
    require_once('includes/functions.php');

    if (!is_logged() && isset($_COOKIE['login_hash']) && $_COOKIE['login_hash'] != 0) {
        $hash = $_COOKIE['login_hash'];
        $_SESSION['user_id'] = $GLOBALS['link']->query("SELECT `user_id` FROM `login_hashes` WHERE `hash` = '{$hash}'")->fetch()['user_id'];
    }

    if (is_logged()) {
        $CUR_USER = get_user_row_by_id($_SESSION['user_id']);
        update_last_seen();
    }
?>

<?php include 'views/header.php'; ?>

<link rel="stylesheet" href="<?php echo $URL; ?>/css/terms.css">

<h1 id="terms-title">תקנון ותנאי השימוש - אלפא דייט</h1>
<p id="temrs-disclamer">
    בעת שימוש בשירותי האתר אני מאשר/ת כי קראתי את התקנון ותנאי השימוש ואני מסכים/ה לו ולכל סעיפיו. <br>
    תקנון זה כתוב בלשון זכר אך תקף לכל המינים.
</p>

<ol class="terms-list">
    <li>אני מאשר את היותי בן 18 ומעלה.</li>
</ol>

<h3 class="terms-list-title">תכנים אסורים</h3>
<ol class="terms-list">
    <li>תכנים המביעים אלימות כלפי אדם אחר.</li>
    <li>תכנים המכילים תוכן פורנוגרפי, בוטה או פדופילי.</li>
    <li>תכנים המכילים עידוד פגיעה עצמית, גזענות, סקסיזם או כל פעילות פלילית אחרת</li>
    <li>תכנים שנועדו לקידום אינטרסים אישיים</li>
    <li>תוכן זבל או ספאם</li>
    <li>תוכנות פוגעניות, וירוסים, תוכנות נוזקה שונות.</li>
    <li>אין לפרסם תוכן על אדם אחר מבלי לבקש את רשותו.</li>
    <li>תכנים טורדניים או מעליבים.</li>
    <li>טכנים המזכירים אתרים מתחרים.</li>
</ol>

<h3 class="terms-list-title">זכויות יוצרים</h3>
<p>
    זכויות היוצרים של מבנה האתר, עיצובו וקניינו הרוחני שייכות לאתר אלפא דייט.
    
</p>

<h3 class="terms-list-title">פרופילים ופרטיות</h3>
<ol class="terms-list">
    <li>על המידע שמשתמשים מזינים בפרופיל שלהם, כגון, שם, עיר מגורים, גיל ועוד להיות אמיתי.</li>
    <li>הנהלת האתר מתחייבת לשמירת פרטי המשתמשים.</li>
    <li>להנהלת האתר קיימת הזכות להשתמש בפרטי המשתמשים בצורה דמוגרפית.</li>
    <li>הנהלת האתר רשאית גם לעיין בהודעות המשתמשים במקרים כמו דיווח או למטרה תיעודית.</li>
    <li>השימוש באתר הוא באחריות המשתמש בלבד. אין הנהלת האתר אחראית בכל מקרה של פגיעה כלשהי. עם זאת, הנהלת האתר תעשה הכל על מנת למנוע מקרים לא מתבקשים.</li>
    <li>כל עוד לא ביקשתי אחרת, הנהלת האתר רשאית לשלוח לי מיילים שיווקיים או כל תוכן אחר במייל.</li>
    <li>אין הנהלת האתר מתחייבת במענה לתמיכה טכנית או כל פנייה אחרת אך תעשה הכל על מנת לענות לרוב הפניות. <a href="<?php echo $URL; ?>/contact/">צור קשר</a></li>
</ol>

<p>
    עם הפרת חוזה זה, רשאית הנהלת האתר להפר את התחייבויותיה כלפי המשתמש המפר,
    הפרת חוזה זה עלולה ל
</p>

<?php include 'views/footer.php'; ?>